Revit 2027 API
DirectShape.AddReferencePlane(Plane) Method
 Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddReferencePlane(
	Plane refPlane
)
Public Sub AddReferencePlane (
	refPlane As Plane
)
public:
void AddReferencePlane(
	Plane^ refPlane
)
member AddReferencePlane :
        refPlane : Plane -> unit
Parameters
refPlane Plane
 The geometry of the new reference plane.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
AddReferencePlane Overload
Autodesk.Revit.DB Namespace